app/views/home_bar/index.html.erb

SELECT "home_bars".* FROM "home_bars" LIMIT 1
---
                - <%= @current_country.name %>
                <%= "- " + I18n.t("home_bar.index.zip") + @current_bar.zip if !@current_bar.zip.blank? %>