app/controllers/principal_controller.rb

  def index
    #TODO: buscar só a página principal ativa
    @principals = Principal.all
    #@principal = Principal.limit(1).where("active = true")

    #TODO: selecionar 8 bares de forma aleatoria!
    @home_bars = HomeBar.limit(8).all


    #@home_bar = HomeBar.find(params[:name])

    @home_bar = HomeBar.find_by_name(get_current_bar_name)
---
SELECT "principals".* FROM "principals" LIMIT 1
SELECT "home_bars".* FROM "home_bars" LIMIT 8
SELECT "home_bars".* FROM "home_bars" WHERE "home_bars"."name" IS NULL LIMIT 1

  def contact

    #TODO: COLOKR BUSCA 'PRINCIPALS' EM TDAS JAH Q VAI USAR EM TDAS
    #todo: gambiarra - tirar
    @principals = Principal.all
---
SELECT "principals".* FROM "principals"